luc-github/ESP3D/esp8266/webinterface.cpp
  KeysList.add(FPSTR(KEY_IP));
  if (wifi_get_opmode() == WIFI_STA )
    stmp = WiFi.localIP().toString();
  else stmp = WiFi.softAPIP().toString();
  ValuesList.add(stmp);

  //Web address = ip + port
  KeysList.add(FPSTR(KEY_WEB_ADDRESS));
  if (wifi_config.iweb_port != 80)
    {
      stmp.concat(":");
      stmp.concat(wifi_config.iweb_port);
    }
  ValuesList.add(stmp);
}
// -----------------------------------------------------------------------------
// Helper for Wifi Mode
// -----------------------------------------------------------------------------
void GetMode(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList)
{
  if (wifi_get_opmode() == WIFI_STA )
    {
      KeysList.add(FPSTR(KEY_MODE));
      ValuesList.add(FPSTR(VALUE_STA));
    }
  else
    {
      if (wifi_get_opmode() == WIFI_AP )
	{
	  KeysList.add(FPSTR(KEY_MODE));
	  ValuesList.add(FPSTR(VALUE_AP));
	}
      else
	{
	  KeysList.add(FPSTR(KEY_MODE));
	  ValuesList.add(FPSTR(VALUE_AP_STA));
	}
    }
}
// -----------------------------------------------------------------------------
// Helper for Web ports
// -----------------------------------------------------------------------------
void GetPorts(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList)
{
  //Web port
  KeysList.add(FPSTR(KEY_WEB_PORT));
  ValuesList.add(intTostr(wifi_config.iweb_port));
  //Data port
  KeysList.add(FPSTR(KEY_DATA_PORT));
  ValuesList.add(intTostr(wifi_config.idata_port));
}
// -----------------------------------------------------------------------------
// Helper for Page properties
// -----------------------------------------------------------------------------
void SetPageProp(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList,
		 const __FlashStringHelper *title, const __FlashStringHelper *filename)
{
  String fullFilename(filename);
  fullFilename.concat(".tpl");

  //page title
  KeysList.add(FPSTR(KEY_PAGE_TITLE));
  ValuesList.add(title);
  //tpl file name with extension
  KeysList.add(FPSTR(KEY_FILE_NAME));
  ValuesList.add(fullFilename);
  //tpl file name without extension
  KeysList.add(FPSTR(KEY_SHORT_FILE_NAME));
  ValuesList.add(filename);
}

// -----------------------------------------------------------------------------
// Helper for DHCP (APP/STA)tus
// -----------------------------------------------------------------------------
void GetDHCPStatus(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList)
{
  KeysList.add(FPSTR(KEY_AP_DHCP_STATUS));
  if (wifi_softap_dhcps_status() == DHCP_STARTED) ValuesList.add(FPSTR(VALUE_STARTED));
  else ValuesList.add(FPSTR(VALUE_STOPPED));

  KeysList.add(FPSTR(KEY_STA_DHCP_STATUS));
  if (wifi_station_dhcpc_status()==DHCP_STARTED)ValuesList.add(FPSTR(VALUE_STARTED));
  else ValuesList.add(FPSTR(VALUE_STOPPED));
}

// -----------------------------------------------------------------------------
// Helper for Error Msg processing
// -----------------------------------------------------------------------------
void ProcessAlertError(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList, String & smsg)
{
  KeysList.add(FPSTR(KEY_ERROR_MSG));
  ValuesList.add(smsg);
  KeysList.add(FPSTR(KEY_SUCCESS_MSG));
  ValuesList.add("");
  KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
  ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
  KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
  KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
  KeysList.add(FPSTR(KEY_SERVICE_PAGE));
  ValuesList.add("");
}

// -----------------------------------------------------------------------------
// Helper for Success Msg processing
// -----------------------------------------------------------------------------
void ProcessAlertSuccess(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList, String & smsg)
{
  KeysList.add(FPSTR(KEY_ERROR_MSG));
  ValuesList.add("");
  KeysList.add(FPSTR(KEY_SUCCESS_MSG));
  ValuesList.add(smsg);
  KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
  ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
  KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
  KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
}

// -----------------------------------------------------------------------------
// Helper for No Msg processing
// -----------------------------------------------------------------------------
void ProcessNoAlert(STORESTRINGS_CLASS & KeysList, STORESTRINGS_CLASS & ValuesList)
{
  KeysList.add(FPSTR(KEY_ERROR_MSG));
  ValuesList.add("");
  KeysList.add(FPSTR(KEY_SUCCESS_MSG));
  ValuesList.add("");
  KeysList.add(FPSTR(KEY_ERROR_MSG_VISIBILITY ));
  ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
  KeysList.add(FPSTR(KEY_SUCCESS_MSG_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
  KeysList.add(FPSTR(KEY_SUBMIT_BUTTON_VISIBILITY));
  ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
  KeysList.add(FPSTR(KEY_SERVICE_PAGE));
  ValuesList.add("");
}

//root insterface
void handle_web_interface_root()
{
	String stmp;
	long lstatus;
	int istatus;
	byte bbuf;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	struct softap_config apconfig;
	struct ip_info info;
	uint8_t mac [WL_MAC_ADDR_LENGTH];

	KeysList.add(FPSTR(KEY_DISCONNECT_VISIBILITY));
	if (web_interface->is_authenticated())ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	else ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));

	//IP+Web
	GetIpWeb(KeysList, ValuesList);

	//Hostname
	if (wifi_get_opmode()==WIFI_STA )
		{
		KeysList.add(FPSTR(KEY_MODE));
		ValuesList.add(FPSTR(VALUE_STA));
		KeysList.add(FPSTR(KEY_HOSTNAME));
		ValuesList.add(wifi_config.get_hostname());
		KeysList.add(FPSTR(KEY_HOSTNAME_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
		KeysList.add(FPSTR(KEY_HOSTNAME));
		ValuesList.add(FPSTR(KEY_NOT_APPLICABLE_4_AP));
		KeysList.add(FPSTR(KEY_HOSTNAME_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		if (wifi_get_opmode()==WIFI_AP )
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP));
			}
		else
			{
				KeysList.add(FPSTR(KEY_MODE));
				ValuesList.add(FPSTR(VALUE_AP_STA));
			}
		}

	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_HOME),F("home"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_HOME));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
  
