luc-github/ESP3D/esp8266/webinterface.cpp
	//Chip ID
	KeysList.add(FPSTR(KEY_CHIP_ID));
	ValuesList.add(intTostr(system_get_chip_id()));
	//CPU Freq
	KeysList.add(FPSTR(KEY_CPU_FREQ));
	ValuesList.add(intTostr(system_get_cpu_freq()));
	//SDK Version
	KeysList.add(FPSTR(KEY_SDK_VER));
	ValuesList.add(system_get_sdk_version());

	//MDNS Feature
	#ifdef MDNS_FEATURE
	KeysList.add(FPSTR(KEY_MDNS_NAME));
	stmp="http://";
	stmp+=wifi_config.get_hostname();
	stmp+=".local";
	ValuesList.add(stmp);
	KeysList.add(FPSTR(KEY_MDNS_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	#else
	KeysList.add(FPSTR(KEY_MDNS_NAME));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_MDNS_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif

	//SSDP Feature
	#ifdef SSDP_FEATURE
	KeysList.add(FPSTR(KEY_SSDP_STATUS));
	ValuesList.add(FPSTR(VALUE_ENABLED));
	KeysList.add(FPSTR(KEY_SSDP_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	#else
	KeysList.add(FPSTR(KEY_SSDP_STATUS));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_SSDP_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif

	//Captive portal Feature
	#ifdef CAPTIVE_PORTAL_FEATURE
	if (wifi_get_opmode()==WIFI_AP)
		{
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
		ValuesList.add(FPSTR(VALUE_ENABLED));
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
		ValuesList.add(FPSTR(VALUE_DISABLED));
		KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		}
	#else
	KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_STATUS));
	ValuesList.add(FPSTR(VALUE_DISABLED));
	KeysList.add(FPSTR(KEY_CAPTIVE_PORTAL_VISIBLE));
	ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	#endif

	//network	
	KeysList.add(FPSTR(KEY_NET_PHY));
	if (wifi_get_phy_mode()==PHY_MODE_11B) ValuesList.add(FPSTR(VALUE_11B));
	else if (wifi_get_phy_mode()==PHY_MODE_11G)ValuesList.add(FPSTR(VALUE_11G));
	else ValuesList.add(FPSTR(VALUE_11N));
	//sleep mode
	KeysList.add(FPSTR(KEY_SLEEP_MODE));
	if (wifi_get_sleep_type()==NONE_SLEEP_T) ValuesList.add(FPSTR(VALUE_NONE));
	else if (wifi_get_sleep_type()==LIGHT_SLEEP_T) ValuesList.add(FPSTR(VALUE_LIGHT));
	else  ValuesList.add(FPSTR(VALUE_MODEM));
	//Boot version
	KeysList.add(FPSTR(KEY_BOOT_VER));
	ValuesList.add(intTostr(system_get_boot_version()));
	//Baud rate
	KeysList.add(FPSTR(KEY_BAUD_RATE));
	ValuesList.add(intTostr(wifi_config.baud_rate));
	// Web and Data ports
	GetPorts(KeysList, ValuesList);

	//AP part
	if (wifi_get_opmode()==WIFI_AP ||  wifi_get_opmode()==WIFI_AP_STA) 
		{
		int client_counter=0;
		struct station_info * station;
		//AP is enabled
		KeysList.add(FPSTR(KEY_AP_STATUS_ENABLED));
		ValuesList.add(FPSTR(VALUE_ENABLED));
		//set visible
		KeysList.add(FPSTR(KEY_AP_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		//list of connected clients
		station = wifi_softap_get_station_info();
		while(station)
			{
				//Row number
				 stmp = "$ROW_NUMBER["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				stmp=String(client_counter+1);
				ValuesList.add(stmp);
				//BSSID
				stmp = "$MAC_CONNECTED["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				ValuesList.add(wifi_config.mac2str(station->bssid));
				//IP
				stmp = "$IP_CONNECTED["+String(client_counter)+"]$";
				KeysList.add(stmp.c_str());
				ValuesList.add(wifi_config.ip2str((byte *)&station->ip));
			    //increment counter
				client_counter++;
				//go next record
				station = STAILQ_NEXT(station, next);
			}
		wifi_softap_free_station_info();
		//Connected clients
		KeysList.add(FPSTR(KEY_CONNECTED_STATIONS_NB_ITEMS));
		ValuesList.add(intTostr(client_counter));
		}
	else
		{
		//AP is disabled
		KeysList.add(FPSTR(KEY_AP_STATUS_ENABLED));
		ValuesList.add(FPSTR(VALUE_DISABLED));
		//set hide
		KeysList.add(FPSTR(KEY_AP_VISIBILITY));
		ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		//Connected clients
		KeysList.add(FPSTR(KEY_CONNECTED_STATIONS_NB_ITEMS));
		ValuesList.add("0");
		}
	//AP mac address
	KeysList.add(FPSTR(KEY_AP_MAC));
	ValuesList.add(wifi_config.mac2str(WiFi.softAPmacAddress(mac)));
	//AP configuration
	if (wifi_softap_get_config(&apconfig))
		{
		//SSID
		KeysList.add(FPSTR(KEY_AP_SSID));
		ValuesList.add((char *)(apconfig.ssid));
		//AP visible or hidden
		KeysList.add(FPSTR(KEY_AP_IS_VISIBLE));
		if(apconfig.ssid_hidden==1)ValuesList.add(FPSTR(VALUE_NO));
		else ValuesList.add(FPSTR(VALUE_YES));
		//Channel
		KeysList.add(FPSTR(KEY_AP_CHANNEL));
		ValuesList.add(intTostr(apconfig.channel));
		//Authentification mode
		KeysList.add(FPSTR(KEY_AP_AUTH));
		if (apconfig.authmode==AUTH_OPEN)ValuesList.add(FPSTR(VALUE_NONE));
		else if (apconfig.authmode==AUTH_WEP)ValuesList.add(FPSTR(VALUE_WEP));
		else if (apconfig.authmode==AUTH_WPA_PSK)ValuesList.add(FPSTR(VALUE_WPA));
		else if (apconfig.authmode==AUTH_WPA2_PSK)ValuesList.add(FPSTR(VALUE_WPA2));
      else ValuesList.add(FPSTR(VALUE_WPAWPA2));

		//Max connections
		KeysList.add(FPSTR(KEY_AP_MAX_CON));
		ValuesList.add(intTostr(apconfig.max_connection));
		}
	else
		{
		//SSID
		KeysList.add(FPSTR(KEY_AP_SSID));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//AP visible or hidden
		KeysList.add(FPSTR(KEY_AP_IS_VISIBLE));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Channel
		KeysList.add(FPSTR(KEY_AP_CHANNEL));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Authentification mode
		KeysList.add(FPSTR(KEY_AP_AUTH));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		//Max connections
		KeysList.add(FPSTR(KEY_AP_MAX_CON));
		ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
		}
		//DHCP Status
		GetDHCPStatus(KeysList, ValuesList);
		//IP/GW/MASK
		if (wifi_get_ip_info(SOFTAP_IF,&info))
		{
			//IP address
			KeysList.add(FPSTR(KEY_AP_IP));
			ValuesList.add(wifi_config.ip2str(info.ip.addr));
			//GW address
			KeysList.add(FPSTR(KEY_AP_GW));
			ValuesList.add(wifi_config.ip2str(info.gw.addr));
			//Sub Net Mask
			KeysList.add(FPSTR(KEY_AP_SUBNET));
			ValuesList.add(wifi_config.ip2str(info.netmask.addr));
		}
	else
		{
			//IP address
			KeysList.add(FPSTR(KEY_AP_IP));
			ValuesList.add(FPSTR(VALUE_NO_IP));
			//GW address
			KeysList.add(FPSTR(KEY_AP_GW));
			ValuesList.add(FPSTR(VALUE_NO_IP));
			//Sub Net Mask
			KeysList.add(FPSTR(KEY_AP_SUBNET));
			ValuesList.add(FPSTR(VALUE_NO_IP));
		}
	//STA part
	if (wifi_get_opmode()==WIFI_STA ||  wifi_get_opmode()==WIFI_AP_STA) 
		{
			//STA is enabled
			KeysList.add(FPSTR(KEY_STA_STATUS_ENABLED));
			ValuesList.add(FPSTR(VALUE_ENABLED));
			//set visible
			KeysList.add(FPSTR(KEY_STA_VISIBILITY));
			ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
		}
	else
		{
			//STA is disabled
			KeysList.add(FPSTR(KEY_STA_STATUS_ENABLED));
			ValuesList.add(FPSTR(VALUE_DISABLED));
			//set hide
			KeysList.add(FPSTR(KEY_STA_VISIBILITY));
			ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
		}
	//STA mac address
	KeysList.add(FPSTR(KEY_STA_MAC));
	ValuesList.add(wifi_config.mac2str(WiFi.macAddress(mac)));
	//SSID used by STA
	KeysList.add(FPSTR(KEY_STA_SSID));
	if (WiFi.SSID().length()==0)ValuesList.add(FPSTR(VALUE_NOT_AVAILABLE));
	else ValuesList.add(WiFi.SSID().c_str());
	//Channel
	KeysList.add(FPSTR(KEY_STA_CHANNEL));
	ValuesList.add(intTostr (wifi_get_channel()));
	//Connection status
	istatus = wifi_station_get_connect_status();
	KeysList.add(FPSTR(KEY_STA_STATUS));
	if (istatus==STATION_GOT_IP) ValuesList.add(FPSTR(VALUE_CONNECTED));
	else if  (istatus==STATION_NO_AP_FOUND) ValuesList.add(FPSTR(VALUE_NO_SSID));
	else if  (istatus==STATION_CONNECT_FAIL) ValuesList.add(FPSTR(VALUE_CONNECTION_FAILED));
	else if  (istatus==STATION_WRONG_PASSWORD) ValuesList.add(FPSTR(VALUE_CONNECTION_FAILED2));
	else if  (istatus==STATION_IDLE) ValuesList.add(FPSTR(VALUE_IDLE));//should not happen
	else ValuesList.add(FPSTR(VALUE_DISCONNECTED));
	//DHCP Client status
	GetDHCPStatus(KeysList, ValuesList);
	//IP address
	KeysList.add(FPSTR(KEY_STA_IP));
	ValuesList.add(WiFi.localIP().toString().c_str());
	//GW address
	KeysList.add(FPSTR(KEY_STA_GW));
	ValuesList.add(WiFi.gatewayIP().toString().c_str());
	//Sub Net Mask
	KeysList.add(FPSTR(KEY_STA_SUBNET));
	ValuesList.add(WiFi.subnetMask().toString().c_str());
	//Service page / no need refresh on this page
	KeysList.add(FPSTR(KEY_SERVICE_PAGE));
	ValuesList.add("");
 //Firmware & Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);

	//process the template file and provide list of variables
	processTemplate("/home.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_configSys()
{
  static const char NOT_AUTH_CS [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=CONFIGSYS\r\nCache-Control: no-cache\r\n\r\n";
  
	String stmp,smsg;
	long lstatus;
	int istatus;
	byte bbuf;
	long ibaud=DEFAULT_BAUD_RATE;
	int iweb_port =DEFAULT_WEB_PORT;
	int idata_port =DEFAULT_DATA_PORT;
	byte bsleepmode=DEFAULT_SLEEP_MODE;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	long lbaudlist[] = {9600 ,19200,38400,57600,115200,230400,250000,-1};
	int bmodemvaluelist[] = {NONE_SLEEP_T,LIGHT_SLEEP_T,MODEM_SLEEP_T, -1};
	const __FlashStringHelper  *smodemdisplaylist[]={FPSTR(VALUE_NONE),FPSTR(VALUE_LIGHT),FPSTR(VALUE_MODEM),FPSTR(VALUE_MODEM)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;

	if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_CS);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_HOME),F("system"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_SYSTEM));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  	  if (web_interface->WebServer.hasArg("BAUD_RATE") && web_interface->WebServer.hasArg("SLEEP_MODE")&& web_interface->WebServer.hasArg("DATAPORT")&& web_interface->WebServer.hasArg("WEBPORT"))
		{   //is each value correct ?
			ibaud  = web_interface->WebServer.arg("BAUD_RATE").toInt();
			iweb_port  = web_interface->WebServer.arg("WEBPORT").toInt();
			idata_port  = web_interface->WebServer.arg("DATAPORT").toInt();
			bsleepmode = web_interface->WebServer.arg("SLEEP_MODE").toInt();

