luc-github/ESP3D/esp8266/webinterface.cpp
			if (!(iweb_port>0 && iweb_port<65001))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: invalid port value for web port<BR>"));
					KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(idata_port>0 && idata_port<65001))
				{
					msg_alert_error=true;
	      smsg.concat("Error: invalid port value for data port<BR>");
					KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (iweb_port== idata_port)
				{
					msg_alert_error=true;
	      smsg.concat("Error: web port and data port cannot be identical<BR>");
					KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
					KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(ibaud==9600 || ibaud==19200|| ibaud==38400|| ibaud==57600|| ibaud==115200|| ibaud==230400 || ibaud==250000)) 
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: value for baud rate is not correct<BR>"));
					KeysList.add(FPSTR(KEY_BAUD_RATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(bsleepmode==NONE_SLEEP_T ||bsleepmode==LIGHT_SLEEP_T ||bsleepmode==MODEM_SLEEP_T ))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: value for sleeping mode is not correct<BR>"));
					KeysList.add(FPSTR(KEY_SLEEP_MODE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
	  }
	  else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	   //if no error apply the changes
		if (msg_alert_error!=true)
			{
			 if(!CONFIG::write_buffer(EP_BAUD_RATE,(const byte *)&ibaud,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_WEB_PORT,(const byte *)&iweb_port,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_DATA_PORT,(const byte *)&idata_port,INTEGER_LENGTH)||!CONFIG::write_byte(EP_SLEEP_MODE,bsleepmode))
				{
					msg_alert_error=true;
	      smsg = FPSTR(EEPROM_NOWRITE);
				}
			else
				{
					msg_alert_success=true;
					wifi_config.iweb_port=iweb_port;
					wifi_config.idata_port=idata_port;
	      smsg = F("Changes saved to EEPROM, restarting....");
				}
			}
  }
  else //no submit need to get data from EEPROM
	{
	if (!CONFIG::read_buffer(EP_BAUD_RATE,  (byte *)&ibaud , INTEGER_LENGTH))ibaud=DEFAULT_BAUD_RATE;
	if (!CONFIG::read_byte(EP_SLEEP_MODE, &bsleepmode ))bsleepmode=DEFAULT_SLEEP_MODE;
	if (!CONFIG::read_buffer(EP_WEB_PORT,  (byte *)&iweb_port , INTEGER_LENGTH))iweb_port=DEFAULT_WEB_PORT;
	if (!CONFIG::read_buffer(EP_DATA_PORT,  (byte *)&idata_port , INTEGER_LENGTH))idata_port=DEFAULT_DATA_PORT;
	}
	//Baud rate list
	istatus = 0;
	stmp="";
	while (lbaudlist[istatus]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(lbaudlist[istatus]);
		stmp+="\" ";
		if (lbaudlist[istatus]==ibaud)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=intTostr(lbaudlist[istatus]);
		stmp+= "</OPTION>\n";
		istatus++;
		}
	 KeysList.add(FPSTR(KEY_BAUD_RATE_OPTIONS_LIST));
	 ValuesList.add(stmp);
	 //Sleep Mode
	 istatus = 0;
	stmp="";
	while (bmodemvaluelist[istatus]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(bmodemvaluelist[istatus]);
		stmp+="\" ";
		if (bmodemvaluelist[istatus]==bsleepmode)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=smodemdisplaylist[istatus];
		stmp+= "</OPTION>\n";
		istatus++;
		}
	 KeysList.add(FPSTR(KEY_SLEEP_MODE_OPTIONS_LIST));
	 ValuesList.add(stmp);
	 
	// Web and Data ports
	GetPorts(KeysList, ValuesList);

	if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
	else if (msg_alert_success)
	{
      ProcessAlertSuccess(KeysList, ValuesList, smsg);
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		KeysList.add(FPSTR(KEY_BAUD_RATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_SLEEP_MODE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_WEB_PORT_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_DATA_PORT_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
    ProcessNoAlert(KeysList, ValuesList);
	
  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);
  
	//process the template file and provide list of variables
	processTemplate("/system.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_password()
{
  static const char NOT_AUTH_PW [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=PASSWORD\r\nCache-Control: no-cache\r\n\r\n";
  
  String smsg;
	String sPassword,sPassword2;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
   	int ipos;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
  
	if (!web_interface->is_authenticated())
	{
	web_interface->WebServer.sendContent_P(NOT_AUTH_PW);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_CHANGE_PASSWORD),F("password"));
	//menu item
  KeysList.add(FPSTR(KEY_MENU_ADMIN));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check if it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg("PASSWORD") && web_interface->WebServer.hasArg("PASSWORD2"))
		{	
		    //Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    web_interface->urldecode(sPassword2,web_interface->WebServer.arg("PASSWORD2").c_str());
		    if (!web_interface->isAdminPasswordValid(sPassword.c_str()) )
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect password<BR>"));
				KeysList.add(FPSTR(KEY_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			if (sPassword!=sPassword2)
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Passwords do not match<BR>"));
				KeysList.add(FPSTR(KEY_PASSWORD_STATUS2));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
		}
      else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	  
	   //if no error apply the change
	   if (msg_alert_error==false)
		{
		//save
		 if(!CONFIG::write_string(EP_ADMIN_PWD,sPassword.c_str()))
			{
				msg_alert_error=true;
	      smsg = FPSTR(EEPROM_NOWRITE);
			}
		else
				{
					msg_alert_success=true;
	      smsg = F("Changes saved to EEPROM");
				}
			}
		}
  
