luc-github/ESP3D/esp8266/webinterface.cpp
	else //no submit, need to get data from EEPROM
	{
	//password 
	sPassword="";
	sPassword2="";
	}
	//Display values
	//password
	KeysList.add(FPSTR(KEY_PASSWORD));
	ValuesList.add(sPassword);
	KeysList.add(FPSTR(KEY_PASSWORD2));
	ValuesList.add(sPassword2);

if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
	else if (msg_alert_success)
	{
      ProcessAlertSuccess(KeysList, ValuesList, smsg);
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
		//Add all green
		KeysList.add(FPSTR(KEY_PASSWORD_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_PASSWORD_STATUS2));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
    ProcessNoAlert(KeysList,ValuesList);
  
  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);
    
	//process the template file and provide list of variables
	processTemplate("/password.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}


void handle_web_interface_configAP()
{
  static const char NOT_AUTH_AP [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=CONFIGAP\r\nCache-Control: no-cache\r\n\r\n";
  
	String stmp,smsg;
	String sSSID,sPassword,sIP,sGW,sMask;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
    byte visible_buf;
    byte static_ip_buf;
    byte auth_buf;
    byte channel_buf;
    byte phy_mode_buf;
    byte ip_sav[4];
	byte gw_sav[4];
	byte msk_sav[4];
	int ipos;
	int inetworkvaluelist []={PHY_MODE_11B,PHY_MODE_11G,-1};
	const __FlashStringHelper  * inetworkdisplaylist []={FPSTR(VALUE_11B),FPSTR(VALUE_11G),FPSTR(VALUE_11B)};
	int iauthvaluelist[] = {AUTH_OPEN,AUTH_WPA_PSK,AUTH_WPA2_PSK,AUTH_WPA_WPA2_PSK,-1};
	const __FlashStringHelper  * iauthdisplaylist[] = {FPSTR(VALUE_NONE),FPSTR(VALUE_WPA),FPSTR(VALUE_WPA2),FPSTR(VALUE_WPAWPA2)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
  
	if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_AP);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_CONFIG_AP),F("config_ap"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_AP));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg("SSID") && web_interface->WebServer.hasArg("PASSWORD")&& web_interface->WebServer.hasArg("NETWORK")
	      && web_interface->WebServer.hasArg("AUTHENTIFICATION")&& web_interface->WebServer.hasArg("IP")
	      && web_interface->WebServer.hasArg("GATEWAY")&& web_interface->WebServer.hasArg("SUBNET")
	      && web_interface->WebServer.hasArg("CHANNEL"))
		{	
			//SSID
		    web_interface->urldecode(sSSID,web_interface->WebServer.arg("SSID").c_str());
		    if (!web_interface->isSSIDValid(sSSID.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect SSID<BR>"));
				KeysList.add(FPSTR(KEY_AP_SSID_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
		    //Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    if (!web_interface->isPasswordValid(sPassword.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect password<BR>"));
				KeysList.add(FPSTR(KEY_AP_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//ssid visible ?	
			if (web_interface->WebServer.hasArg("SSID_VISIBLE")) 
				{
					visible_buf=1;
				}
			else
				{
					visible_buf=0;
				}
			//phy mode
			phy_mode_buf  = byte(web_interface->WebServer.arg("NETWORK").toInt());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G) )
				 {
					msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect network<BR>"));
					KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
			//channel
			channel_buf  = byte (web_interface->WebServer.arg("CHANNEL").toInt());
			if (channel_buf< 1|| channel_buf>11) 
				 {
					msg_alert_error=true;
	      smsg.concat("Error: Incorrect channel<BR>");
					KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
			//authentification
			auth_buf  = byte(web_interface->WebServer.arg("AUTHENTIFICATION").toInt());
	  if (!(auth_buf == AUTH_OPEN || auth_buf == AUTH_WEP || auth_buf == AUTH_WPA_PSK ||
		auth_buf == AUTH_WPA2_PSK || auth_buf == AUTH_WPA_WPA2_PSK))
				 {
					msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect authentification method<BR>"));
					KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }	
		    //Static IP ?	
			if (web_interface->WebServer.hasArg("STATIC_IP") )
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			web_interface->urldecode(sIP,web_interface->WebServer.arg("IP").c_str());
			if (!web_interface->isIPValid(sIP.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect IP fortmat<BR>"));
				KeysList.add(FPSTR(KEY_AP_IP_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Gateway
			web_interface->urldecode(sGW,web_interface->WebServer.arg("GATEWAY").c_str());
			if (!web_interface->isIPValid(sGW.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect gateway<BR>"));
				KeysList.add(FPSTR(KEY_AP_GW_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//subnet
			web_interface->urldecode(sMask,web_interface->WebServer.arg("SUBNET").c_str());
			if (!web_interface->isIPValid(sMask.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect subnet<BR>"));
				KeysList.add(FPSTR(KEY_AP_SUBNET_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}   	  	    
		}
      else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	  
	   //if no error apply the change
	   if (msg_alert_error==false)
		{
		//save
		 wifi_config.split_ip(sIP.c_str(),ip_sav);
		 wifi_config.split_ip(sGW.c_str(),gw_sav);
		 wifi_config.split_ip(sMask.c_str(),msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,AP_MODE))||
			(!CONFIG::write_string(EP_SSID,sSSID.c_str()))||
			(!CONFIG::write_string(EP_PASSWORD,sPassword.c_str()))||
			(!CONFIG::write_byte(EP_SSID_VISIBLE,visible_buf))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_CHANNEL,channel_buf)) ||
			(!CONFIG::write_byte(EP_AUTH_TYPE,auth_buf)) ||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGTH)))
			{
				msg_alert_error=true;
	      smsg = FPSTR(EEPROM_NOWRITE);
			}
		else
				{
					msg_alert_success=true;
	      smsg = F("Changes saved to EEPROM, restarting...");
				}
			}
		}
  
