luc-github/ESP3D/esp8266/webinterface.cpp
	else //no submit need to get data from EEPROM
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, sSSID , MAX_SSID_LENGTH) )sSSID=FPSTR(DEFAULT_SSID);
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, sPassword , MAX_PASSWORD_LENGTH) )sPassword=FPSTR(DEFAULT_PASSWORD);
	//ssid visible ?
	if (!CONFIG::read_byte(EP_SSID_VISIBLE, &visible_buf ))visible_buf=DEFAULT_SSID_VISIBLE;
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//authentification
	if (!CONFIG::read_byte(EP_AUTH_TYPE, &auth_buf ))auth_buf=DEFAULT_AUTH_TYPE;
	//channel
	if (!CONFIG::read_byte(EP_CHANNEL, &channel_buf ))channel_buf=DEFAULT_CHANNEL;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,ip_sav , IP_LENGTH) )
		sIP=wifi_config.ip2str((byte *)DEFAULT_IP_VALUE);
	else
		sIP=wifi_config.ip2str(ip_sav);  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,gw_sav , IP_LENGTH) )
		sGW=wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE);
	else
		sGW=wifi_config.ip2str(gw_sav);  
	
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,msk_sav , IP_LENGTH) )
		sMask=wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE);
	else
		sMask=wifi_config.ip2str(msk_sav);  
	}
	
	//Display values
	
  //ssid
	KeysList.add(FPSTR(KEY_AP_SSID));
	ValuesList.add(sSSID);
	
	//password
	KeysList.add(FPSTR(KEY_AP_PASSWORD));
	ValuesList.add(sPassword);

	//ssid visible ?
	KeysList.add(FPSTR(KEY_IS_SSID_VISIBLE));
	if (visible_buf==1)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
  
	//network
	ipos = 0;
	stmp="";
	while (inetworkvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(inetworkvaluelist[ipos]);
		stmp+="\" ";
		if (inetworkvaluelist[ipos]==phy_mode_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=inetworkdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST));
	 ValuesList.add(stmp);
	 
	 //channel
	 stmp ="";
	  for (int c=1;c < 12;c++)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+=intTostr(c);
		stmp+="\" ";
		if (channel_buf==c)stmp += FPSTR(VALUE_SELECTED);
		else stmp+="";
		stmp+=" >";
		stmp+=intTostr(c);
		stmp+= "</OPTION>\n";
		}
  
	 KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST));
	 ValuesList.add(stmp);
	//auth
	ipos = 0;
	stmp="";
	while (iauthvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(iauthvaluelist[ipos]);
		stmp+="\" ";
		if (iauthvaluelist[ipos]==auth_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=iauthdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST));
	 ValuesList.add(stmp);

	 //static IP ?
	KeysList.add(FPSTR(KEY_IS_STATIC_IP));
	if (static_ip_buf==STATIC_IP_MODE)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
	
	//IP for static IP
	KeysList.add(FPSTR(KEY_AP_IP));
	ValuesList.add(sIP);
	 
	//Gateway for static IP
	KeysList.add(FPSTR(KEY_AP_GW));
	ValuesList.add(sGW);
	  
	//Mask for static IP
	KeysList.add(FPSTR(KEY_AP_SUBNET));
	ValuesList.add(sMask);

if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
	else if (msg_alert_success)
	{
      ProcessAlertSuccess(KeysList, ValuesList, smsg);
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		//Add all green
		KeysList.add(FPSTR(KEY_AP_SSID_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_PASSWORD_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_IS_SSID_VISIBLE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_CHANNEL_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AUTH_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_STATIC_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_GW_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_AP_SUBNET_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
    ProcessNoAlert(KeysList,ValuesList);	

  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);
	//process the template file and provide list of variables
	processTemplate("/config_ap.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_configSTA()
{
  static const char NOT_AUTH_STA [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=CONFIGSTA\r\nCache-Control: no-cache\r\n\r\n";
  
	String stmp,smsg;
	String sSSID,sPassword,sIP,sGW,sMask,sHostname;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
    byte static_ip_buf;
    byte phy_mode_buf;
    byte ip_sav[4];
	byte gw_sav[4];
	byte msk_sav[4];
	bool revertSTA=false;
	int ipos;
	int inetworkvaluelist []={PHY_MODE_11B,PHY_MODE_11G,PHY_MODE_11N,-1};
	const __FlashStringHelper  * inetworkdisplaylist []={FPSTR(VALUE_11B),FPSTR(VALUE_11G),FPSTR(VALUE_11N),FPSTR(VALUE_11B)};
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
  
	if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_STA);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_CONFIG_STA),F("config_sta"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_STA));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
	
  smsg="";
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if (web_interface->WebServer.hasArg("SSID") && web_interface->WebServer.hasArg("PASSWORD")&& web_interface->WebServer.hasArg("NETWORK")
	     && web_interface->WebServer.hasArg("IP") && web_interface->WebServer.hasArg("GATEWAY")&& web_interface->WebServer.hasArg("SUBNET")
	     && web_interface->WebServer.hasArg("HOSTNAME"))
		{	
			//SSID
		    web_interface->urldecode(sSSID,web_interface->WebServer.arg("SSID").c_str());
		    if (!web_interface->isSSIDValid(sSSID.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect SSID<BR>"));
				KeysList.add(FPSTR(KEY_STA_SSID_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    if (!web_interface->isPasswordValid(sPassword.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect password<BR>"));
				KeysList.add(FPSTR(KEY_STA_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
				
			//Hostname
		    web_interface->urldecode(sHostname,web_interface->WebServer.arg("HOSTNAME").c_str());
		    if (!web_interface->isHostnameValid(sHostname.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect hostname<BR>"));
				KeysList.add(FPSTR(KEY_HOSTNAME_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			
			//phy mode
			phy_mode_buf  = byte(web_interface->WebServer.arg("NETWORK").toInt());
			if (!(phy_mode_buf==PHY_MODE_11B||phy_mode_buf==PHY_MODE_11G||phy_mode_buf==PHY_MODE_11N) )
				 {
					msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect network<BR>"));
					KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				 }
				 
		   //Static IP ?	
			if (web_interface->WebServer.hasArg("STATIC_IP") )
				{
					static_ip_buf=STATIC_IP_MODE;
				}
			else
				{
					static_ip_buf=DHCP_MODE;
				}
				
			//IP
			web_interface->urldecode(sIP,web_interface->WebServer.arg("IP").c_str());
			if (!web_interface->isIPValid(sIP.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect IP format<BR>"));
				KeysList.add(FPSTR(KEY_STA_IP_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}

			//Gateway
			web_interface->urldecode(sGW,web_interface->WebServer.arg("GATEWAY").c_str());
			if (!web_interface->isIPValid(sGW.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect gateway<BR>"));
				KeysList.add(FPSTR(KEY_STA_GW_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			//subnet
			web_interface->urldecode(sMask,web_interface->WebServer.arg("SUBNET").c_str());
			if (!web_interface->isIPValid(sMask.c_str()))
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect subnet<BR>"));
				KeysList.add(FPSTR(KEY_STA_SUBNET_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}   	  	    
		}
     else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	   
	   //no error ? then save
	   if (msg_alert_error==false)
		{
		//save
		 wifi_config.split_ip(sIP.c_str(),ip_sav);
		 wifi_config.split_ip(sGW.c_str(),gw_sav);
		 wifi_config.split_ip(sMask.c_str(),msk_sav);
		 if((!CONFIG::write_byte(EP_WIFI_MODE,CLIENT_MODE))||
			(!CONFIG::write_string(EP_SSID,sSSID.c_str()))||
			(!CONFIG::write_string(EP_PASSWORD,sPassword.c_str()))||
			(!CONFIG::write_string(EP_HOSTNAME,sHostname.c_str()))||
			(!CONFIG::write_byte(EP_PHY_MODE,phy_mode_buf))||
			(!CONFIG::write_byte(EP_IP_MODE,static_ip_buf)) ||
			(!CONFIG::write_buffer(EP_IP_VALUE,ip_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_GATEWAY_VALUE,gw_sav,IP_LENGTH))||
			(!CONFIG::write_buffer(EP_MASK_VALUE,msk_sav,IP_LENGTH)))
			{
				msg_alert_error=true;
	      smsg = FPSTR(EEPROM_NOWRITE);
			}
		else
				{
					msg_alert_success=true;
	      smsg = F("Changes saved to EEPROM, restarting...");
				}
			}
		}
	else //no submit, need to get data from EEPROM
	{
	//ssid
	if (!CONFIG::read_string(EP_SSID, sSSID , MAX_SSID_LENGTH) )sSSID=FPSTR(DEFAULT_SSID);
	//password 
	if (!CONFIG::read_string(EP_PASSWORD, sPassword , MAX_PASSWORD_LENGTH) )sPassword=FPSTR(DEFAULT_PASSWORD);
	//hostname 
	if (!CONFIG::read_string(EP_HOSTNAME, sHostname , MAX_HOSTNAME_LENGTH) )sHostname=wifi_config.get_default_hostname();
	//phy mode
	if (!CONFIG::read_byte(EP_PHY_MODE, &phy_mode_buf ))phy_mode_buf=DEFAULT_PHY_MODE;
	//static IP ?
	if (!CONFIG::read_byte(EP_IP_MODE, &static_ip_buf ))static_ip_buf=DEFAULT_IP_MODE;
	//IP for static IP
	if (!CONFIG::read_buffer(EP_IP_VALUE,ip_sav , IP_LENGTH) )
		sIP=wifi_config.ip2str((byte *)DEFAULT_IP_VALUE);
	else
		sIP=wifi_config.ip2str(ip_sav);  
	//GW for static IP
	if (!CONFIG::read_buffer(EP_GATEWAY_VALUE,gw_sav , IP_LENGTH) )
		sGW=wifi_config.ip2str((byte *)DEFAULT_GATEWAY_VALUE);
	else
		sGW=wifi_config.ip2str(gw_sav);  
	//Subnet for static IP
	if (!CONFIG::read_buffer(EP_MASK_VALUE,msk_sav , IP_LENGTH) )
		sMask=wifi_config.ip2str((byte *)DEFAULT_MASK_VALUE);
	else
		sMask=wifi_config.ip2str(msk_sav);  
	}
	//Display values
	//ssid
	KeysList.add(FPSTR(KEY_STA_SSID));
	ValuesList.add(sSSID);
	
	//password
	KeysList.add(FPSTR(KEY_STA_PASSWORD));
	ValuesList.add(sPassword);
	
	//hostname
	KeysList.add(FPSTR(KEY_HOSTNAME));
	ValuesList.add(sHostname);
  
