luc-github/ESP3D/esp8266/webinterface.cpp
	//network
	ipos = 0;
	stmp="";
	while (inetworkvaluelist[ipos]>-1)
		{
		stmp+="<OPTION VALUE=\"";
		stmp+= intTostr(inetworkvaluelist[ipos]);
		stmp+="\" ";
		if (inetworkvaluelist[ipos]==phy_mode_buf)stmp+=FPSTR(VALUE_SELECTED);
		stmp+=">" ;
		stmp+=inetworkdisplaylist[ipos];
		stmp+= "</OPTION>\n";
		ipos++;
		}
	 KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST));
	 ValuesList.add(stmp);
	 
	 //static IP ?
	KeysList.add(FPSTR(KEY_IS_STATIC_IP));
	if (static_ip_buf==STATIC_IP_MODE)ValuesList.add(VALUE_CHECKED);
	else ValuesList.add("");
	
	//IP for static IP
	KeysList.add(FPSTR(KEY_STA_IP));
	ValuesList.add(sIP);
	 
	//Gateway for static IP
	KeysList.add(FPSTR(KEY_STA_GW));
	ValuesList.add(sGW);
	  
	//Mask for static IP
	KeysList.add(FPSTR(KEY_STA_SUBNET));
	ValuesList.add(sMask);
	
	//do we need to do a scan and display it ?
	 if (!msg_alert_success)
		 {
			   //if in AP mode switch to mixed mode to be able to scan
			  if (wifi_get_opmode()!=WIFI_STA )
				{
					WiFi.mode(WIFI_AP_STA);
					revertSTA=true;
				}
				
			  int n = WiFi.scanNetworks();
			  for (int i = 0; i < n; ++i)
				{
				   //row number
				  stmp = "$ROW_NUMBER["+String(i)+"]$";
				  KeysList.add(stmp);
				  stmp=String(i+1);
				  ValuesList.add(stmp);
				  //SSID
				stmp = "$AP_SSID["+String(i)+"]$";
				KeysList.add(stmp);
				ValuesList.add(WiFi.SSID(i).c_str());
				//signal strength
				 stmp = "$AP_SIGNAL["+String(i)+"]$";
				 KeysList.add(stmp);
				 stmp = intTostr(100+WiFi.RSSI(i)) ;
				 stmp += "%";
				 ValuesList.add(stmp);
				//is protected
				stmp = "$IS_PROTECTED["+String(i)+"]$";
				 KeysList.add(stmp);
				 if (WiFi.encryptionType(i) == ENC_TYPE_NONE)  ValuesList.add(FPSTR(VALUE_NO));
				 else  ValuesList.add(FPSTR(VALUE_YES));
				}
			WiFi.scanDelete();
			KeysList.add(FPSTR(KEY_AVAILABLE_AP_NB_ITEMS));
			ValuesList.add(intTostr(n));
				 
		  //revert to pure softAP
		   if (revertSTA) WiFi.mode(WIFI_AP);
		   KeysList.add(FPSTR(KEY_AP_SCAN_VISIBILITY));
		   ValuesList.add(VALUE_ITEM_VISIBLE);
		  }
	else
		{//no need to do a scan if we are going to restart
		KeysList.add(FPSTR(KEY_AP_SCAN_VISIBILITY));
	   ValuesList.add(VALUE_ITEM_HIDDEN);
	   KeysList.add(FPSTR(KEY_AVAILABLE_AP_NB_ITEMS));
	  ValuesList.add(intTostr(0));
		}

if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
	else if (msg_alert_success)
	{
      ProcessAlertSuccess(KeysList, ValuesList, smsg);
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add(FPSTR(RESTARTCMD));
		//Add all green
		KeysList.add(FPSTR(KEY_STA_SSID_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_PASSWORD_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_NETWORK_OPTION_LIST_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_STATIC_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_IP_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_GW_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_STA_SUBNET_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_HOSTNAME_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
	}
	
	else
	
    ProcessNoAlert(KeysList,ValuesList);	
	
  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);
	//process the template file and provide list of variables
	processTemplate("/config_sta.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_printer()
{
  static const char NOT_AUTH_PRT [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=PRINTER\r\nCache-Control: no-cache\r\n\r\n";
  
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
  
	if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_PRT);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);		
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_PRINTER),F("printer"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_PRINTER));
	ValuesList.add(FPSTR(VALUE_ACTIVE));
	
	//Refresh page time
	KeysList.add(FPSTR(KEY_REFRESH_PAGE));
	byte bflag;
	if (!CONFIG::read_byte(EP_REFRESH_PAGE_TIME, &bflag ))ValuesList.add(intTostr(DEFAULT_REFRESH_PAGE_TIME*1000));
    else ValuesList.add(intTostr(1000*bflag));
    int istatus;
    //xy feedrate
	KeysList.add(FPSTR(KEY_XY_FEEDRATE));
	if (!CONFIG::read_buffer(EP_XY_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_XY_FEEDRATE;
	ValuesList.add(intTostr(istatus));
	//Z feedrate
	KeysList.add(FPSTR(KEY_Z_FEEDRATE));
	if (!CONFIG::read_buffer(EP_Z_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_Z_FEEDRATE;
	ValuesList.add(intTostr(istatus));
	//E feedrate
	KeysList.add(FPSTR(KEY_E_FEEDRATE));
	if (!CONFIG::read_buffer(EP_E_FEEDRATE,  (byte *)&istatus , INTEGER_LENGTH))istatus=DEFAULT_E_FEEDRATE;
	ValuesList.add(intTostr(istatus));

	 //Serial.println("M114");
  Serial.println(F("M220"));
  Serial.println(F("M221"));
    KeysList.add(FPSTR(KEY_SERVICE_PAGE));
	ValuesList.add("");

  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);
	
	processTemplate("/printer.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_settings()
{
  static const char NOT_AUTH_SET [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /LOGIN?return=SETTINGS\r\nCache-Control: no-cache\r\n\r\n";
  
  String smsg;
	int istatus;
	byte bbuf;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	byte irefresh_page;
	int ixy_feedrate,iz_feedrate,ie_feedrate;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
  
	if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_SET);
		return;
	}

	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_SETTINGS),F("settings"));
	//menu item
	KeysList.add(FPSTR(KEY_MENU_SETTINGS));
	ValuesList.add(FPSTR(VALUE_ACTIVE));

  //check is it is a submission or a display
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  	  if (web_interface->WebServer.hasArg("REFRESH_PAGE") && web_interface->WebServer.hasArg("XY_FEEDRATE")&& web_interface->WebServer.hasArg("Z_FEEDRATE")&& web_interface->WebServer.hasArg("E_FEEDRATE"))
		{   //is each value correct ?
			irefresh_page  = web_interface->WebServer.arg("REFRESH_PAGE").toInt();
			ixy_feedrate  = web_interface->WebServer.arg("XY_FEEDRATE").toInt();
			iz_feedrate  = web_interface->WebServer.arg("Z_FEEDRATE").toInt();
			ie_feedrate = web_interface->WebServer.arg("E_FEEDRATE").toInt();

			if (!(irefresh_page>1 && irefresh_page<120))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: invalid value for refresh time<BR>"));
					KeysList.add(FPSTR(KEY_REFRESH_PAGE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(ixy_feedrate>0 && ixy_feedrate<9999))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: invalid value for XY axis feedrate<BR>"));
					KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			 if (!(iz_feedrate>0 && iz_feedrate<9999))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: invalid value for Z axis feedrate<BR>"));
					KeysList.add(FPSTR(KEY_Z_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
			if (!(ie_feedrate>0 && ie_feedrate<9999))
				{
					msg_alert_error=true;
	      smsg.concat(F("Error: invalid value for Extruder feedrate<BR>"));
					KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
					ValuesList.add(FPSTR(VALUE_HAS_ERROR));
			    }
	  }
	  else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	   //if no error apply the changes
		if (msg_alert_error!=true)
			{
			 if(!CONFIG::write_buffer(EP_XY_FEEDRATE,(const byte *)&ixy_feedrate,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_Z_FEEDRATE,(const byte *)&iz_feedrate,INTEGER_LENGTH)||!CONFIG::write_buffer(EP_E_FEEDRATE,(const byte *)&ie_feedrate,INTEGER_LENGTH)||!CONFIG::write_byte(EP_REFRESH_PAGE_TIME,irefresh_page))
				{
					msg_alert_error=true;
	      smsg = FPSTR(EEPROM_NOWRITE);
				}
			else
				{
					msg_alert_success=true;
	      smsg = F("Changes saved to EEPROM");
				}
			}
  }
  else //no submit need to get data from EEPROM
	{
	if (!CONFIG::read_buffer(EP_XY_FEEDRATE,  (byte *)&ixy_feedrate , INTEGER_LENGTH))ixy_feedrate=DEFAULT_XY_FEEDRATE;
	if (!CONFIG::read_byte(EP_REFRESH_PAGE_TIME, &irefresh_page ))irefresh_page=DEFAULT_REFRESH_PAGE_TIME;
	if (!CONFIG::read_buffer(EP_Z_FEEDRATE,  (byte *)&iz_feedrate , INTEGER_LENGTH))iz_feedrate=DEFAULT_Z_FEEDRATE;
	if (!CONFIG::read_buffer(EP_E_FEEDRATE,  (byte *)&ie_feedrate , INTEGER_LENGTH))ie_feedrate=DEFAULT_E_FEEDRATE;
	}
	//fill the variables
	//refresh page
	KeysList.add(FPSTR(KEY_REFRESH_PAGE));
	ValuesList.add(intTostr(irefresh_page));
	//xy feedrate
	KeysList.add(FPSTR(KEY_XY_FEEDRATE));
	ValuesList.add(intTostr(ixy_feedrate));
	//Z feedrate
	KeysList.add(FPSTR(KEY_Z_FEEDRATE));
	ValuesList.add(intTostr(iz_feedrate));
	//E feedrate
	KeysList.add(FPSTR(KEY_E_FEEDRATE));
	ValuesList.add(intTostr(ie_feedrate));
	
	if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
	else if (msg_alert_success)
	{
      ProcessAlertSuccess(KeysList, ValuesList, smsg);
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
		KeysList.add(FPSTR(KEY_REFRESH_PAGE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_XY_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_Z_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_E_FEEDRATE_STATUS));
		ValuesList.add(FPSTR(VALUE_HAS_SUCCESS));
		KeysList.add(FPSTR(KEY_SERVICE_PAGE));
		ValuesList.add("");
	}
	
	else
	
    ProcessNoAlert(KeysList,ValuesList);
	
