luc-github/ESP3D/esp8266/webinterface.cpp
  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);

	//process the template file and provide list of variables
	processTemplate("/settings.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}

void handle_web_interface_status()
{
	static const char NO_TEMP_LINE[] PROGMEM = "\"temperature\":\"0\",\"target\":\"0\",\"active\":\"0\"";
	web_interface->is_authenticated();
	Serial.println(F("M114"));
	int tagpos,tagpos2;
	String buffer2send;
	String value;
	int temperature,target;
  
	//request temperature only if no feedback
	if ((system_get_time()-web_interface->last_temp)>2000000)
    Serial.println(F("M105"));

	if ((system_get_time()-web_interface->last_temp)<3200000)
		{
		value="Connected";
		}
	else if ((system_get_time()-web_interface->last_temp)<32000000)
		{
		value="Busy";
		}
	else 
		{
		value="Offline";
		}

	//start JSON answer
	buffer2send="{";
	//status color
	buffer2send+="\"status\":\""+value +"\",";
	//speed
	buffer2send+="\"speed\":\""+web_interface->answer4M220 +"\",";
	//flow
	buffer2send+="\"flow\":\""+web_interface->answer4M221 +"\",";
	//X position
	tagpos = web_interface->answer4M114.indexOf("X:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Xpos\":\""+value +"\",";
	//Y position
	tagpos = web_interface->answer4M114.indexOf("Y:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Ypos\":\""+value +"\",";
	//Z position
	tagpos = web_interface->answer4M114.indexOf("Z:");
	tagpos2 = web_interface->answer4M114.indexOf(" ",tagpos);
	value=web_interface->answer4M114.substring(tagpos+2,tagpos2);
	buffer2send+="\"Zpos\":\""+value +"\",";
	//heater
  buffer2send.concat(F("\"heater\":["));
  //Extruder 1
  buffer2send.concat(F("{\"name\":\"Extruder 1\","));
	int Tpos = web_interface->answer4M105.indexOf("T0:");
	byte bshift=1;
	if (Tpos==-1)
		{
		Tpos = web_interface->answer4M105.indexOf("T:");
		bshift=0;
		}
	int slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
	int spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
	//have Extruder 1 ?
	if(slashpos!=-1 && spacepos!=-1 )
			{
      buffer2send += "\"temperature\":\""+web_interface->answer4M105.substring(Tpos+2+bshift,slashpos)+
	"\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
	else{//no extruder temperature
    buffer2send.concat(FPSTR(NO_TEMP_LINE));
			}
	
	buffer2send+="},";
	//Extruder 2
  buffer2send.concat(F("{\"name\":\"Extruder 2\","));
	Tpos = web_interface->answer4M105.indexOf("T1:");
	if (Tpos>-1) //have extruder 2 ?
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
		if(slashpos!=-1 && spacepos!=-1 )
			{
	  buffer2send += "\"temperature\":\""+web_interface->answer4M105.substring(Tpos+3,slashpos)+
	    "\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
		else{//no extruder temperature
	buffer2send.concat(FPSTR(NO_TEMP_LINE));
			}
		}	
	else{//no extruder temperature
    buffer2send.concat(FPSTR(NO_TEMP_LINE));
			}
	buffer2send+="},";
	
	//Bed
  buffer2send.concat(F("{\"name\":\"Bed\","));
	Tpos = web_interface->answer4M105.indexOf("B:");
	if (Tpos>-1)
		{
		slashpos = web_interface->answer4M105.indexOf(" /",Tpos);	
		spacepos = web_interface->answer4M105.indexOf(" ",slashpos+2);
		if(slashpos!=-1 && spacepos!=-1 )
			{
			temperature = (int)atof(web_interface->answer4M105.substring(Tpos+2,slashpos).c_str());
			target = (int)atof(web_interface->answer4M105.substring(slashpos+2,spacepos).c_str());
	  buffer2send += "\"temperature\":\""+web_interface->answer4M105.substring(Tpos+2,slashpos)+
	    "\",\"target\":\""+web_interface->answer4M105.substring(slashpos+2,spacepos)+"\",\"active\":\"1\"";
			}
		else{//no extruder temperature
	buffer2send.concat(FPSTR(NO_TEMP_LINE));
			}
		}	
	else{//no extruder temperature
    buffer2send.concat(FPSTR(NO_TEMP_LINE));
			}
	buffer2send+="}";
	buffer2send+="],";
	
	//information
  buffer2send.concat(F("\"InformationMsg\":["));
	for (int i=0;i<web_interface->info_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->info_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="],";
	//Error
  buffer2send.concat(F("\"ErrorMsg\":["));
	for (int i=0;i<web_interface->error_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->error_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="],";
	//Status
  buffer2send.concat(F("\"StatusMsg\":["));
	for (int i=0;i<web_interface->status_msg.size();i++)
	{
		if (i>0)buffer2send+=",";
		buffer2send+="{\"line\":\"";
		buffer2send+=web_interface->status_msg.get(i);
		buffer2send+="\"}";
	}
	buffer2send+="]";
	buffer2send+="}";
	web_interface->WebServer.sendHeader("Cache-Control", "no-cache");
	web_interface->WebServer.send(200, "application/json",buffer2send);	
}

String formatBytes(size_t bytes){
  if (bytes < 1024){
    return String(bytes)+" B";
  } else if(bytes < (1024 * 1024)){
    return String(bytes/1024.0)+" KB";
  } else if(bytes < (1024 * 1024 * 1024)){
    return String(bytes/1024.0/1024.0)+" MB";
  } else {
    return String(bytes/1024.0/1024.0/1024.0)+" GB";
  }
}

String getContentType(String filename){
   if(filename.endsWith(".htm")) return "text/html";
  else if(filename.endsWith(".html")) return "text/html";
  else if(filename.endsWith(".css")) return "text/css";
  else if(filename.endsWith(".js")) return "application/javascript";
  else if(filename.endsWith(".png")) return "image/png";
  else if(filename.endsWith(".gif")) return "image/gif";
  else if(filename.endsWith(".jpg")) return "image/jpeg";
  else if(filename.endsWith(".ico")) return "image/x-icon";
  else if(filename.endsWith(".xml")) return "text/xml";
  else if(filename.endsWith(".pdf")) return "application/x-pdf";
  else if(filename.endsWith(".zip")) return "application/x-zip";
  else if(filename.endsWith(".gz")) return "application/x-gzip";
  else if(filename.endsWith(".tpl")) return "text/plain";
  else if(filename.endsWith(".inc")) return "text/plain";
  else if(filename.endsWith(".txt")) return "text/plain";
  return "application/octet-stream";
}

void SPIFFSFileupload()
{
  HTTPUpload& upload = (web_interface->WebServer).upload();
  if(upload.status == UPLOAD_FILE_START){
    String filename = upload.filename;
    web_interface->fsUploadFile = SPIFFS.open(filename, "w");
    filename = String();
  } else if(upload.status == UPLOAD_FILE_WRITE){
    if(web_interface->fsUploadFile)
		{
		web_interface->fsUploadFile.write(upload.buf, upload.currentSize);
		}
  } else if(upload.status == UPLOAD_FILE_END){
    if(web_interface->fsUploadFile)
      web_interface->fsUploadFile.close();
  }
  else Serial.println("Cannot open file");
}

void WebUpdateUpload()
{
	HTTPUpload& upload = (web_interface->WebServer).upload();
	if(upload.status == UPLOAD_FILE_START){
    Serial.println(F("M117 Update Firmware"));
	web_interface->_upload_status= UPLOAD_STATUS_ONGOING;
	WiFiUDP::stopAll();
	uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
	if(!Update.begin(maxSketchSpace)){//start with max available size
	}
	} else if(upload.status == UPLOAD_FILE_WRITE){
	web_interface->_upload_status= UPLOAD_STATUS_ONGOING;
	if(Update.write(upload.buf, upload.currentSize) != upload.currentSize){
	}
	} else if(upload.status == UPLOAD_FILE_END){
	if(Update.end(true)){ //true to set the size to the current progress
	  //Now Reboot
	  web_interface->_upload_status=UPLOAD_STATUS_SUCCESSFUL;
	} 
	} else if(upload.status == UPLOAD_FILE_ABORTED){
	Update.end();
	web_interface->_upload_status=UPLOAD_STATUS_CANCELLED;
	}
	yield();
}


void handleUpdate(){
	web_interface->is_authenticated();
	String jsonfile = "{\"status\":\"" ;
	jsonfile+=intTostr(web_interface->_upload_status);
	jsonfile+="\"}";
	//send status
	web_interface->WebServer.sendHeader("Cache-Control", "no-cache");
	web_interface->WebServer.send(200, "application/json", jsonfile);
	//if success restart
	if (web_interface->_upload_status==UPLOAD_STATUS_SUCCESSFUL)web_interface->restartmodule=true;
}

void handleFileList() {
	if (!web_interface->is_authenticated())
	{
		return;
	}
	String path = "/";
	String status="Ok";

	if(web_interface->WebServer.hasArg("action")) {
		if(web_interface->WebServer.arg("action")=="delete" && web_interface->WebServer.hasArg("filename"))
			{
				String filename;
				 web_interface->urldecode(filename,web_interface->WebServer.arg("filename").c_str());
				if(!SPIFFS.exists(filename)){
					 status="Cannot delete, file not found!";
					}
				else
					{
						SPIFFS.remove(filename);
					}
			}
	  }
	String jsonfile = "{\"path\":\"" + path + "\",";
	Dir dir = SPIFFS.openDir(path);
	jsonfile+="\"files\":[";
	bool firstentry=true;
	while (dir.next()) {
		if (!firstentry) jsonfile+=",";
		else firstentry=false;
		jsonfile+="{";
		jsonfile+="\"name\":\"";
		jsonfile+=dir.fileName();
		jsonfile+="\",\"size\":\"";
		File f = dir.openFile("r");
		jsonfile+=formatBytes(f.size());
		jsonfile+="\"";
		jsonfile+="}";
		f.close();
		}	
	jsonfile+="],";
	jsonfile+="\"status\":\"" + status + "\",";
	FSInfo info;
	SPIFFS.info(info);
	jsonfile+="\"total\":\"" + formatBytes(info.totalBytes) + "\",";
	jsonfile+="\"used\":\"" + formatBytes(info.usedBytes) + "\",";
  jsonfile.concat(F("\"occupation\":\""));
	jsonfile+= intTostr(100*info.usedBytes/info.totalBytes);
	jsonfile+="\"";
	jsonfile+="}";
	path = "";
	web_interface->WebServer.sendHeader("Cache-Control", "no-cache");
	web_interface->WebServer.send(200, "application/json", jsonfile);
}

void handleSDFileList() {
	if (!web_interface->is_authenticated())
	{
		return;
	}
	String jsonfile = "[";
	for (int i=0;i<web_interface->fileslist.size();i++)
	{
		if (i>0)jsonfile+=",";
		jsonfile+="{\"entry\":\"";
		jsonfile+=web_interface->fileslist.get(i);
		jsonfile+="\"}";
	}
	jsonfile+="]";
	web_interface->WebServer.sendHeader("Cache-Control", "no-cache");
	web_interface->WebServer.send(200, "application/json", jsonfile);
}

