luc-github/ESP3D/esp8266/webinterface.cpp
//do a redirect to avoid to many query
//and handle not registred path
void handle_not_found()
{
  static const char NOT_AUTH_NF [] PROGMEM = "HTTP/1.1 301 OK\r\nLocation: /\r\nCache-Control: no-cache\r\n\r\n";
  
  if (!web_interface->is_authenticated())
	{
      web_interface->WebServer.sendContent_P(NOT_AUTH_NF);
		return;
	}
  
  String path = web_interface->WebServer.uri();
  String contentType = getContentType(path);
  String pathWithGz = path + ".gz";
  if(SPIFFS.exists(pathWithGz) || SPIFFS.exists(path))
	{
      if(SPIFFS.exists(pathWithGz)) path = pathWithGz;
		File file = SPIFFS.open(path, "r");
		web_interface->WebServer.streamFile(file, contentType);
		file.close();
	}
else 
	{
		if (SPIFFS.exists("/404.tpl"))
			{
			STORESTRINGS_CLASS KeysList ;
			STORESTRINGS_CLASS ValuesList ;
			String stmp;

	  //IP+Web
	  GetIpWeb(KeysList, ValuesList);
			//mode
	  GetMode(KeysList, ValuesList);
	  //page title and filenames
	  SetPageProp(KeysList,ValuesList,F("404 Page not found"),F("404"));

    //Firmware and Free Mem, at the end to reflect situation
    GetFreeMem(KeysList, ValuesList);
	  
			//process the template file and provide list of variables
			processTemplate("/404.tpl", KeysList , ValuesList);
			//need to clean to speed up memory recovery
			KeysList.clear();
			ValuesList.clear();
			}
		else
		{ //if not template use default page
			contentType=FPSTR(PAGE_404);
			String stmp;
			if (wifi_get_opmode()==WIFI_STA ) stmp=WiFi.localIP().toString();
			else stmp=WiFi.softAPIP().toString();
			//Web address = ip + port
			String KEY_IP = FPSTR(KEY_WEB_ADDRESS);
			if (wifi_config.iweb_port!=80)
				{
				stmp+=":";
				stmp+=intTostr(wifi_config.iweb_port);
				}
			contentType.replace(KEY_IP,stmp);
			web_interface->WebServer.send(200,"text/html",contentType);
		}
	}
}

void handle_login()
{
  static const char NOT_AUTH_LOG [] PROGMEM = "HTTP/1.1 301 OK\r\nSet-Cookie: ESPSESSIONID=0\r\nLocation: /LOGIN\r\nCache-Control: no-cache\r\n\r\n";
  
  String smsg;
	String sReturn;
	String sPassword;
	bool msg_alert_error=false;
	bool msg_alert_success=false;
	STORESTRINGS_CLASS KeysList ;
	STORESTRINGS_CLASS ValuesList ;
	
	if (web_interface->WebServer.hasArg("DISCONNECT")){
    web_interface->WebServer.sendContent_P(NOT_AUTH_LOG);
    return;
  }
  
  //check is it is a submission or a display
  smsg="";
  if (web_interface->WebServer.hasArg("return")) web_interface->urldecode(sReturn,web_interface->WebServer.arg("return").c_str());
  if (web_interface->WebServer.hasArg("SUBMIT"))
  {   //is there a correct list of values?
	  if ( web_interface->WebServer.hasArg("PASSWORD"))
		{	
		    #ifdef AUTHENTICATION_FEATURE
		    //Password
		    web_interface->urldecode(sPassword,web_interface->WebServer.arg("PASSWORD").c_str());
		    String scurrentPassword;
		    
		    if (!CONFIG::read_string(EP_ADMIN_PWD, scurrentPassword , MAX_ADMIN_PASSWORD_LENGTH))
		      scurrentPassword=FPSTR(DEFAULT_ADMIN);
      
		    if (strcmp(sPassword.c_str(),scurrentPassword.c_str())!=0)
				{
				msg_alert_error=true;
	      smsg.concat(F("Error: Incorrect password<BR>"));
				KeysList.add(FPSTR(KEY_PASSWORD_STATUS));
				ValuesList.add(FPSTR(VALUE_HAS_ERROR));
				}
			#endif
		}
      else
	   {
		msg_alert_error=true;
	  smsg = FPSTR(MISSING_DATA);
	   }
	  
	   //if no error login is ok
	   if (msg_alert_error==false)
		{
		#ifdef AUTHENTICATION_FEATURE
		auth_ip * current_auth = new auth_ip;
		current_auth->ip=web_interface->WebServer.client().remoteIP();
		strcpy(current_auth->sessionID,web_interface->create_session_ID());
		current_auth->last_time=millis();
		if (web_interface->AddAuthIP(current_auth))
		{
	      String header = F("HTTP/1.1 301 OK\r\nSet-Cookie: ESPSESSIONID=");
		header+=current_auth->sessionID;
		header+="\r\nLocation: /";
		header+=sReturn;
	      header.concat(F("\r\nCache-Control: no-cache\r\n\r\n"));
		web_interface->WebServer.sendContent(header);
		return;
		}
		else
		{
			delete current_auth;
			msg_alert_error=true;
	      smsg = F("Error: Too many connections");
		}
		#endif
		}
	}
  
	else //no submit need to get data from EEPROM
	{
	sPassword=String();
	}
	
	//Display values
	KeysList.add(FPSTR(KEY_RETURN));
	ValuesList.add(sReturn);
  
	KeysList.add(FPSTR(KEY_DISCONNECT_VISIBILITY));
	if (web_interface->is_authenticated())ValuesList.add(FPSTR(VALUE_ITEM_VISIBLE));
	else ValuesList.add(FPSTR(VALUE_ITEM_HIDDEN));
	//IP+Web
	GetIpWeb(KeysList, ValuesList);
	//mode
	GetMode(KeysList, ValuesList);
  
	//page title and filenames
	SetPageProp(KeysList,ValuesList,FPSTR(VALUE_LOGIN),F("login"));	
	//password
	KeysList.add(FPSTR(KEY_PASSWORD));
	ValuesList.add(sPassword);

if (msg_alert_error)
    ProcessAlertError(KeysList, ValuesList, smsg);
else
    ProcessNoAlert(KeysList,ValuesList);

  //Firmware and Free Mem, at the end to reflect situation
  GetFreeMem(KeysList, ValuesList);

	//process the template file and provide list of variables
	processTemplate("/login.tpl", KeysList , ValuesList);
	//need to clean to speed up memory recovery
	KeysList.clear();
	ValuesList.clear();
}
void handle_restart()
{
	if (SPIFFS.exists("/restart.tpl"))
		{
		STORESTRINGS_CLASS KeysList ;
		STORESTRINGS_CLASS ValuesList ;

		//IP+Web
		GetIpWeb(KeysList, ValuesList);
		//mode
		GetMode(KeysList, ValuesList);  
		//page title and filenames
		SetPageProp(KeysList,ValuesList,F("Restarting..."),F("restart"));

      //Firmware and Free Mem, at the end to reflect situation
      GetFreeMem(KeysList, ValuesList);
		
		//process the template file and provide list of variables
		processTemplate("/restart.tpl", KeysList , ValuesList);
		//need to clean to speed up memory recovery
		KeysList.clear();
		ValuesList.clear();
		}
	else
		{//if not restart template use default
			String contentType=FPSTR(PAGE_RESTART);
			web_interface->WebServer.send(200,"text/html",contentType);
		}
	web_interface->restartmodule=true;
}

void handle_web_command()
{
	if (!web_interface->is_authenticated())
	{
		return;
	}
	//check we have proper parameter
	if (web_interface->WebServer.hasArg("COM"))
	  {  
		  String scmd;
		  //decode command
		  web_interface->urldecode(scmd,web_interface->WebServer.arg("COM").c_str()); 
		  scmd.trim();
		  //send command to serial
		  Serial.println(scmd);
		  //give an ack - we need to be polite, right ?
		  web_interface->WebServer.send(200,"text/plain","Ok");
		  //if it is for ESP module [ESPXXX]<parameter>
		  int ESPpos = scmd.indexOf("[ESP");
		  if (ESPpos>-1)
			{//is there the second part?
			int ESPpos2 = scmd.indexOf("]",ESPpos);	
			if (ESPpos2>-1)
				{	//Split in command and parameters
					String cmd_part1=scmd.substring(ESPpos+4,ESPpos2);
					String cmd_part2="";
					//is there space for parameters?
					if (ESPpos2<scmd.length())
						{
						cmd_part2=scmd.substring(ESPpos2+1);
						}
					//if command is a valid number then execute command
					if(cmd_part1.toInt()!=0)COMMAND::execute_command(cmd_part1.toInt(),cmd_part2);
					//if not is not a valid [ESPXXX] command
				}
			}
	  }
}


 #ifdef SSDP_FEATURE
 void handle_SSDP(){
      SSDP.schema(web_interface->WebServer.client());
    }
 #endif

//URI Decoding function 
void   WEBINTERFACE_CLASS::urldecode( String & dst, const char *src)
{
  char a, b,c;
  dst="";
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      dst+= char(16*a+b);
      src+=3;
    } 
    else {
		c = *src++;
		if(c=='+')c=' ';
      dst+= char(c);
    }
  }
}


//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
	//init what will handle "/"
	WebServer.on("/",HTTP_ANY, handle_web_interface_root);
	WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
	WebServer.on("/CONFIGAP",HTTP_ANY, handle_web_interface_configAP);
	WebServer.on("/CONFIGSTA",HTTP_ANY, handle_web_interface_configSTA);
	WebServer.on("/STATUS",HTTP_ANY, handle_web_interface_status);
	WebServer.on("/SETTINGS",HTTP_ANY, handle_web_settings);
	WebServer.on("/PRINTER",HTTP_ANY, handle_web_interface_printer);
	WebServer.on("/CMD",HTTP_ANY, handle_web_command);
	WebServer.on("/RESTART",HTTP_GET, handle_restart);
	WebServer.on("/UPDATE",HTTP_ANY, handleUpdate,WebUpdateUpload);
	WebServer.on("/FILES", HTTP_ANY, handleFileList,SPIFFSFileupload);
	WebServer.on("/SDFILES", HTTP_ANY, handleSDFileList);
	WebServer.on("/LOGIN", HTTP_ANY, handle_login);
	WebServer.on("/PASSWORD", HTTP_ANY, handle_password);
	//Captive portal Feature
	#ifdef CAPTIVE_PORTAL_FEATURE
	WebServer.on("/generate_204",HTTP_ANY, handle_web_interface_root);
	WebServer.on("/fwlink",HTTP_ANY, handle_web_interface_root);
	#endif
	#ifdef SSDP_FEATURE
	WebServer.on("/description.xml", HTTP_GET, handle_SSDP);
	#endif
	WebServer.onNotFound( handle_not_found);
	answer4M105="T:0 /0 ";
	answer4M114="X:0.0 Y:0.0 Z:0.000";
	answer4M220="100";
	answer4M221="100";
	last_temp=system_get_time();
	restartmodule=false;
	//rolling list of 4entries with a maximum of 50 char for each entry
	error_msg.setsize(4);
  error_msg.setlength(50);
	info_msg.setsize(4);
  info_msg.setlength(50);
	status_msg.setsize(4);
  status_msg.setlength(50);
  fileslist.setlength(30);//12 for filename + space + size
	fileslist.setsize(70); // 70 files to limite to 2K
	fsUploadFile=(fs::File)0;
	_head=NULL;
	_nb_ip=0;
	_upload_status=UPLOAD_STATUS_NONE;
}
//Destructor
WEBINTERFACE_CLASS::~WEBINTERFACE_CLASS()
{
	info_msg.clear();
	error_msg.clear();
	status_msg.clear();
	fileslist.clear();
	while (_head)
	{
		auth_ip * current = _head;
		_head=_head->_next;
		delete current;
	}
	_nb_ip=0;
}
//Session ID based on IP and time using 16 char
char * WEBINTERFACE_CLASS::create_session_ID(){
static char  sessionID[17];
//reset SESSIONID
for (int i=0;i<17;i++)sessionID[i]='\0';
//get time
uint32_t now = millis();
//get remote IP
IPAddress remoteIP=WebServer.client().remoteIP();
//generate SESSIONID
if (0>sprintf(sessionID,"%02X%02X%02X%02X%02X%02X%02X%02X",remoteIP[0],remoteIP[1],remoteIP[2],remoteIP[3],(uint8_t) ((now >> 0) & 0xff),(uint8_t) ((now >> 8) & 0xff),(uint8_t) ((now >> 16) & 0xff),(uint8_t) ((now >> 24) & 0xff)))strcpy(sessionID,"NONE");
return sessionID;
}
//check authentification
bool  WEBINTERFACE_CLASS::is_authenticated()
{
#ifdef AUTHENTICATION_FEATURE 
 if (WebServer.hasHeader("Cookie")){   
    String cookie = WebServer.header("Cookie");
    int pos = cookie.indexOf("ESPSESSIONID=");
    if (pos!= -1) {
	int pos2 = cookie.indexOf(";",pos);
	String sessionID = cookie.substring(pos+strlen("ESPSESSIONID="),pos2);
	IPAddress ip = WebServer.client().remoteIP();
	//check if cookie can be reset and clean table in same time
    return ResetAuthIP(ip,sessionID.c_str());
	}
  }
  return false;	
#else
return true;
#endif
}

//add the information in the linked list if possible
bool WEBINTERFACE_CLASS::AddAuthIP(auth_ip * item)
{
	if (_nb_ip>MAX_AUTH_IP) return false;
	item->_next=_head;
	_head=item;
	_nb_ip++;
	return true;
}

bool WEBINTERFACE_CLASS::ResetAuthIP(IPAddress ip,const char * sessionID)
{
	bool done=false;
	auth_ip * current = _head;
	auth_ip * previous = NULL;
	//get time
	uint32_t now = millis();
	while (current)
	{
		 if ((millis()-current->last_time)>400000)
		 {
			 //remove
			 if (current==_head)
			 {
				_head=current->_next;
				_nb_ip--;
				delete current;
				current=_head;
			 }
			 else
			 {
				 previous->_next=current->_next; 
				 _nb_ip--;
				delete current;
				current=previous->_next;
			 }
		 }
		 else
		 {
			 if (ip==current->ip)
			 {
				 if (strcmp(sessionID,current->sessionID)==0)
				 {
					 //reset time
					 current->last_time=millis();
					 return true;
				 }
			 }
			previous = current;
			current=current->_next;
		 }
	}
	return done;
}

WEBINTERFACE_CLASS * web_interface;
